app/controllers/days_controller.rb

  def index
    @days = Day.all
---
SELECT "days".* FROM "days"

  def create

    @day = Day.new(date: Time.new, calories: day_params[:calories], user_id: day_params[:user_id])
    # @day = Day.new(day_params)
    @user = User.find(@day.user_id)

    if @day.save
---
SELECT "days".* FROM "days" WHERE "days"."user_id" = ?  [["user_id", 18]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "days" ("date", "calories", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "2020-02-13"], ["calories", 2027.0], ["user_id", 1], ["created_at", "2020-02-13 09:45:50.088436"], ["updated_at", "2020-02-13 09:45:50.088436"]]

  def update
    if @day.update(day_params)
---
UPDATE "days" SET "calories" = ?, "updated_at" = ? WHERE "days"."id" = ?  [["calories", 841.0], ["updated_at", "2020-02-13 10:24:53.793346"], ["id", 1]]

    def set_day
      @day = Day.find(params[:id])
---
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]