app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

SELECT "foods".* FROM "foods" WHERE "foods"."day_id" = ?  [["day_id", 1]]
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "foods" ("day_id", "name", "calories", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["day_id", 1], ["name", "Eggs"], ["calories", 100], ["created_at", "2020-02-13 20:21:42.474296"], ["updated_at", "2020-02-13 20:21:42.474296"]]
---
  def create
    @food = Food.new(food_params)
    @day = Day.find(@food.day_id)
    @user = User.find(@day.user_id)
    if @food.save