app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "age", "sex", "height", "weight", "created_at", "updated_at", "bmr") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."password_digest" = ? AND "users"."email" = ?  [["password_digest", "p1"], ["email", "mariola@gmail.com"]]
---
  def authenticate
    @user = User.where(password_digest: params[:password_digest], email: params[:email])

UPDATE "users" SET "age" = ?, "height" = ?, "weight" = ?, "bmr" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 29], ["height", 170], ["weight", 70], ["bmr", 1456.0], ["updated_at", "2020-02-13 22:00:39.112741"], ["id", 1]]
---
  def update
    if @user.update(user_params)